import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-how-work',
  templateUrl: './how-work.component.html',
  styleUrls: ['./how-work.component.css']
})
export class HowWorkComponent implements OnInit {
  content: string;
  constructor() { }

  ngOnInit() {
    this.content = `
    تقوم اداره المكاتب الخلفية بمهمه دعم فريق المبيعات بمختلف التسهيلات والوسائل
        <br>


يتم استلام جميع الشكاوى وفحصها من خلال أدارة خدمة العملاء بالشركة حيث يتم فحص شكاوى العميل وتجميع المستندات الدالة والتأكد من مطابقتها لشروط وقواعد شركة التأمين من خلال التواصل معه ومن ثمة تخاطب شركة التأمين لعرض طلبات العميل


<br>
يحق للعميل في حالة تقدمه بشكوى مصحوبة بكل المستندات التي تؤكد احقيته ومطابقتها لقواعد وشروط شركة التأمين أن يتوجه للهيئة العامة للرقابة المالية بشكوى مباشرة على البريد الإلكتروني

<br>
<h4>
مساعدة العميل في إجراءات التعويضات
</h4>
تعتبر متابعة تعويضات عملاؤنا من اهم اولويات عملنا و يتم ذلك من خلال فريق عمل فنى مدرب لتقديم أفضل خدمة للعميل حيث نقوم بمساعدة العميل في الحصول على التعويض في حالة حدوث خطر مغطى طبقاً لشروط الوثيقة عن طريق إعلامه بالمستندات المطلوبة ومتابعة جميع إجراءات التعويض حتى إصدار شيك التعويض من شركة التأمين.

<br><br>
<h2>
إجراءات التجديد
</h2>

قبل ميعاد التجديد السنوي بفترة مناسبة يقوم فريق جلوبال ادفايس بتقديم تقرير تحليلي لتعزيز التغطيات التأمينية ومراجعة الشروط والأسعار للتأكد من مواكبتها لمتغيرات السوق التأميني.

<br>
تتم كذلك المراجعة الشاملة لوثيقة التأمين و جميع بياناتها من اجل التأكد من ان الوثيقة تغطى أي مستجدات تكون قد طرأت على الخطر او أي تغيرات يكون العميل قد اجراها على الشيء موضوع التأمين

    `;
  }

}
