import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-how-work',
  templateUrl: './how-work.component.html',
  styleUrls: ['./how-work.component.css']
})
export class HowWorkComponent implements OnInit {
  content: string;
  constructor() { }

  ngOnInit() {
    this.content = `
    ‫والوسائل‬ ‫التسهيالت‬ ‫بمختلف‬ ‫المبيعات‬ ‫فريق‬ ‫دعم‬ ‫بمهمه‬ ‫الخلفية‬ ‫المكاتب‬ ‫اداره‬ ‫تقوم‬
    <br>
    ‫والتأكد‬ ‫الدالة‬ ‫ات‬ ‫المستند‬ ‫وتجميع‬ ‫العميل‬ ‫شكاوى‬ ‫فحص‬ ‫يتم‬ ‫حيث‬ ‫بالشركة‬ ‫العمالء‬ ‫خدمة‬ ‫أدارة‬ ‫خالل‬ ‫من‬ ‫وفحصها‬ ‫الشكاوى‬ ‫جميع‬ ‫استالم‬ ‫يتم‬
‫العميل‬ ‫طلبات‬ ‫لعرض‬ ‫التأمين‬ ‫شركة‬ ‫تخاطب‬ ‫ثمة‬ ‫ومن‬ ‫معه‬ ‫التواصل‬ ‫خالل‬ ‫من‬ ‫التأمين‬ ‫شركة‬ ‫وقواعد‬ ‫لشروط‬ ‫مطابقتها‬ ‫من‬
<br>
‫للهيئة‬ ‫يتوجه‬ ‫أن‬ ‫ن‬ ‫التأمي‬ ‫شركة‬ ‫وشروط‬ ‫لقواعد‬ ‫ومطابقتها‬ ‫احقيته‬ ‫تؤكد‬ ‫التي‬ ‫المستندات‬ ‫بكل‬ ‫مصحوبة‬ ‫بشكوى‬ ‫تقدمه‬ ‫حالة‬ ‫في‬ ‫للعميل‬ ‫يحق‬
‫اإللكتروني‬ ‫البريد‬ ‫على‬ ‫مباشرة‬ ‫بشكوى‬ ‫المالية‬ ‫للرقابة‬ ‫العامة‬
<br>
<h4>
‫التعويضات‬ ‫إجراءات‬ ‫في‬ ‫العميل‬ ‫مساعدة‬
</h4>
‫نقوم‬ ‫حيث‬ ‫ميل‬ ‫للع‬ ‫خدمة‬ ‫أفضل‬ ‫لتقديم‬ ‫مدرب‬ ‫فنى‬ ‫عمل‬ ‫فريق‬ ‫خالل‬ ‫من‬ ‫ذلك‬ ‫يتم‬ ‫و‬ ‫عملنا‬ ‫اولويات‬ ‫اهم‬ ‫من‬ ‫عمالؤنا‬ ‫تعويضات‬ ‫متابعة‬ ‫تعتبر‬
‫المطلوبة‬ ‫ات‬ ‫بالمستند‬ ‫إعالمه‬ ‫طريق‬ ‫عن‬ ‫الوثيقة‬ ‫لشروط‬ ‫ً‬ ‫طبقا‬ ‫مغطى‬ ‫خطر‬ ‫حدوث‬ ‫حالة‬ ‫في‬ ‫التعويض‬ ‫على‬ ‫الحصول‬ ‫في‬ ‫العميل‬ ‫بمساعدة‬
‫‪.‬‬ ‫التأمين‬ ‫شركة‬ ‫من‬ ‫التعويض‬ ‫شيك‬ ‫إصدار‬ ‫حتى‬ ‫التعويض‬ ‫إجراءات‬ ‫جميع‬ ‫ومتابعة‬

<br><br>
<h2>
‫إجراءات التجديد  
</h2>

‫الشروط‬ ‫ومراجعة‬ ‫تأمينية‬ ‫ال‬ ‫التغطيات‬ ‫لتعزيز‬ ‫تحليلي‬ ‫تقرير‬ ‫بتقديم‬ ‫ادفايس‬ ‫جلوبال‬ ‫فريق‬ ‫يقوم‬ ‫مناسبة‬ ‫بفترة‬ ‫السنوي‬ ‫التجديد‬ ‫ميعاد‬ ‫قبل‬
‫‪.‬‬ ‫التأميني‬ ‫السوق‬ ‫لمتغيرات‬ ‫مواكبتها‬ ‫من‬ ‫للتأكد‬ ‫واألسعار‬

<br>
‫او‬ ‫الخطر‬ ‫على‬ ‫أت‬ ‫طر‬ ‫قد‬ ‫تكون‬ ‫مستجدات‬ ‫أي‬ ‫تغطى‬ ‫الوثيقة‬ ‫ان‬ ‫من‬ ‫التأكد‬ ‫اجل‬ ‫من‬ ‫بياناتها‬ ‫جميع‬ ‫و‬ ‫التامين‬ ‫لوثيقة‬ ‫الشاملة‬ ‫المراجعة‬ ‫كذلك‬ ‫تتم‬
‫التامين‬ ‫موضوع‬ ‫الشيء‬ ‫على‬ ‫اجراها‬ ‫قد‬ ‫العميل‬ ‫يكون‬ ‫تغيرات‬ ‫أي‬
    `;
  }

}
