import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-aboutus',
  templateUrl: './aboutus.component.html',
  styleUrls: ['./aboutus.component.css']
})
export class AboutusComponent implements OnInit {
  content: string;
  slides: string[];
  constructor() { }

  ngOnInit() {
    this.content = `


    جلوبال ادفايس للوساطة التأمينية هي شركة مقيدة في الهيئة العامة للرقابة المالية تحت رقم 85- متخصصة في مجال وساطة التأمين وتعمل مع مقدمي خدمات التأمين الدولي والمحلي. تعمل جلوبال مع كل الشركات ويستخدم أفراد فريق المبيعات ما يتمتعون به من خبرات وتجارب لفهم احتياجات عملائهم من أجل الحصول على مختلف عروض التغطية من جميع مقدمي الخدمة المتاحين ومن ثم مناقشتها مع عملائهم ومساعدتهم في العثور على التغطية التأمينية المثالية التي تتوافق مع احتياجاتهم.  يتمتع عميل جلوبال بميزة تخصيص مدير حساب عملاء محترف يهتم بكافة الاحتياجات التأمينية لعملائه. يتناول مدير حساب العملاء جميع جوانب التأمين الخاصة بالعميل بدءا من اختيار التغطية المناسبة، مرورا بإدارة مواعيد السداد والتجديدات و التعامل مع مطالبات العملاء والرد على استفساراتهم.
    كما تشمل خدماتنا أيضا مراقبة الجودة والمتابعة لضمان رضا العملاء من خلال المكالمات المستمرة، والزيارات، واجراء استطلاع رأي عن مستوي الخدمة المقدمة بصفه دوريه.
    `;

    this.slides = [
      'assets/images/slides/abouts/ins2.jpg',
      'assets/images/slides/abouts/ins3.jpeg',
      'assets/images/slides/abouts/ins1.jpg',
    ]
  }

}
