import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-aboutus',
  templateUrl: './aboutus.component.html',
  styleUrls: ['./aboutus.component.css']
})
export class AboutusComponent implements OnInit {
  content: string;
  constructor() { }

  ngOnInit() {
    this.content = `
    ‫في‬ ‫متخصصة‬ ‫‪-‬‬ ‫‪85‬‬ ‫رقم‬ ‫تحت‬ ‫المالية‬ ‫للرقابة‬ ‫العامة‬ ‫الهيئة‬ ‫في‬ ‫مقيدة‬ ‫شركة‬ ‫هي‬ ‫التأمينية‬ ‫للوساطة‬ ‫ادفايس‬ ‫جلوبال‬
    ‫ويستخدم‬ ‫الشركات‬ ‫كل‬ ‫مع‬ ‫جلوبال‬ ‫تعمل‬ ‫‪.‬‬ ‫والمحلي‬ ‫الدولي‬ ‫التأمين‬ ‫خدمات‬ ‫مقدمي‬ ‫مع‬ ‫وتعمل‬ ‫التأمين‬ ‫وساطة‬ ‫مجال‬
    ‫مختلف‬ ‫على‬ ‫الحصول‬ ‫أجل‬ ‫من‬ ‫عمالئهم‬ ‫احتياجات‬ ‫لفهم‬ ‫وتجارب‬ ‫خبرات‬ ‫من‬ ‫به‬ ‫يتمتعون‬ ‫ما‬ ‫المبيعات‬ ‫فريق‬ ‫أفراد‬
    ‫على‬ ‫العثور‬ ‫في‬ ‫ومساعدتهم‬ ‫عمالئهم‬ ‫مع‬ ‫مناقشتها‬ ‫ثم‬ ‫ومن‬ ‫المتاحين‬ ‫الخدمة‬ ‫مقدمي‬ ‫جميع‬ ‫من‬ ‫التغطية‬ ‫عروض‬
    ‫مالء‬ ‫ع‬ ‫حساب‬ ‫مدير‬ ‫تخصيص‬ ‫بمزية‬ ‫جلوبال‬ ‫عميل‬ ‫يتمتع‬ ‫‪.‬‬ ‫احتياجاتهم‬ ‫مع‬ ‫تتوافق‬ ‫التي‬ ‫المثالية‬ ‫التأمينية‬ ‫التغطية‬
    ‫ميل‬ ‫بالع‬ ‫الخاصة‬ ‫التأمين‬ ‫جوانب‬ ‫جميع‬ ‫العمالء‬ ‫حساب‬ ‫مدير‬ ‫يتناول‬ ‫‪.‬‬ ‫لعمالئه‬ ‫التأمينية‬ ‫احتياجاته‬ ‫بكافة‬ ‫يهتم‬ ‫محترف‬
    ‫على‬ ‫والرد‬ ‫العمالء‬ ‫مطالبات‬ ‫مع‬ ‫التعامل‬ ‫والتجديدات‪،‬‬ ‫السداد‬ ‫مواعيد‬ ‫بإدارة‬ ‫مرورا‬ ‫المناسبة‪،‬‬ ‫التغطية‬ ‫اختيار‬ ‫من‬ ‫بدءا‬
    ‫‪.‬‬ ‫استفساراتهم‬
    <br>
    ‫والزيارات‪،‬‬ ‫المستمرة‪،‬‬ ‫المكالمات‬ ‫خالل‬ ‫من‬ ‫العمالء‬ ‫رضا‬ ‫لضمان‬ ‫والمتابعة‬ ‫الجودة‬ ‫مراقبة‬ ‫أيضا‬ ‫الخدمة‬ ‫هذه‬ ‫تشمل‬
‫سنوية‬ ‫نصف‬ ‫بصفه‬ ‫المقدمة‬ ‫الخدمة‬ ‫مستوي‬ ‫عن‬ ‫رأي‬ ‫استطالع‬ ‫واجراء‬
    `;
  }

}
