import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-our-service',
  templateUrl: './our-service.component.html',
  styleUrls: ['./our-service.component.css']
})
export class OurServiceComponent implements OnInit {
  content: string;
  constructor() { }

  ngOnInit() {
    this.content = `
    الوساطة في إبرام العقود لجميع أنواع التأمين ، سواء التأمين على الحياة أو التأمين الطبي أو العام من خالل
    شركات التأمين العاملة في السوق المصرية ، من خالل دراسة الوضع الحالي للعمالء ومساعدتهم في العثور على
    بوليصة التامين التي تناسب احتياجاتهم
    على اتخاذ القرار المناسب ووضع الحلول التأمينية نبدأ بتحديد متطلبات العميل ثم نستعرض وندرس عروض شركات التامين قبل ان نعود اليه بتوصياتنا لنساعده
    كما ندعم عمالئنا في جميع إجراءات ما بعد البيع مثل التعامل مع المطالبات وتجديد الوثائق واي خدمه تتطلبها
    مصلحة العميل
    جلوبال أدفايس تتعاقد وتتعامل مع جميع شركات التأمين العاملة في مصر بجميع أنواعها وفروعها، وال توجد
    .شركة تأمين محددة ، مما يعطى مجال اختيار أوسع للعميل 
    `;
  }

}
