import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-our-service',
  templateUrl: './our-service.component.html',
  styleUrls: ['./our-service.component.css']
})
export class OurServiceComponent implements OnInit {
  content: string;
  titleTag: string = 'هدفنا راحة بال عملائنا';
  constructor() { }

  ngOnInit() {
    this.content = `
    جلوبال ادفايس هى حلقة الوصل بين العميل و مقدمى خدمات التأمين المحلية و الدولية مما يعطى المجال لإختيار أوسع للعميل
  
    
   سواء فى التأمين على الحياه أو التأمين الطبى أو العام.
   
    كما تتمتع جلوبال ادفايس فى إيجاد تغطيات التأمين المثاليه من خلال دراسة الوضع الحالى للعملاء و مساعدتهم فى العثور على  وثيقة التأمين التى تناسب احتياجتهم.
    
  
    نبدأ بتحديد متطلبات العميل ثم نستعرض وندرس  عروض شركات التأمين قبل ان نعود اليه بتوصياتنا لنساعده على اتخاذ القرار المناسب ووضع الحلول التأمينية المختلفة .
    
    كما ندعم عملائنا في جميع إجراءات ما بعد البيع مثل التعامل مع المطالبات وتجديد الوثائق واي خدمه تتطلبها مصلحة العميل.
    <br>
 

    
    `;
  }

}
