import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-services',
  templateUrl: './services.component.html',
  styleUrls: ['./services.component.css']
})
export class ServicesComponent implements OnInit {
  services: any[];
  constructor() { }

  ngOnInit() {
    this.services = [
      {
        icon: 'favorite',
        title: ' برامج تأمين الحياة',
        content: `
        والتأمين على الحياة هو الشكل األكثر وضوحا للتأمينات. يتم دفع عموما أقساط على أساس
        شهري أو سنوي لتكون عائلتك محمية لهذه الفترة. مجدوله طبقا لإلطار الزمني والميزانية
        التي تناسب العميل 
        `
      },

      {
        icon: 'work',
        title: '  برامج تأمين المعاش والتقاعد',
        content: `
        إن الوقت المناسب للتفكير في وقت التقاعد هو اآلن، حيث تستطيع توفير الموارد الكافية
        التي تضمن لك العيش في نفس المستوى المادي عند تقاعدك وتوفير مستوى مادى أفضل
        `
      },
      
      {
        icon: 'directions_car',
        title: ' برامج تأمين السيارات',
        content: `هذا النوع من التأمين لحمايه السيارات الخاصة والتجارية المؤمن عليها، حيث تتعهد
        الشركة بتعويض المؤمن له عن الضرر أو الخسارة التي تصيب السيارة وملحقاتها وقطع
        غيارها المشمولة بالتأمين وذلك حسب الشروط واالستثناءات الموضحة بوثيقه التأمين.
        `
      },
      
      {
        icon: 'spa',
        title: ' برامج التامين الصحي ',
        content: `كمستشارك التأميني نحن نهتم بصحتك بقدر ما تهتم انت
        تقدم جلوبال ادفايس من خالل خبرتها في هذا المجال مجموعه من البرامج التي سوف
        تساعدك على اختيار أفضل برامج التأمين الطبي سواء لألفراد أو الشركات او المجموعات
        الصغيرة وبأفضل االسعار
        `
      },
      {
        icon: 'flight',
        title: ' برنامج تأمين السفر',
        content: `
        هو التأمين الذي يهدف إلى تغطية النفقات الطبية، وإلغاء الرحلة، واألمتعة المفقودة، وحادث •
الطيران وغيرها من الخسائر المتكبدة أثناء السفر، سواء دوليا أو محليا.
        `
      }
    ];
  }

}
